<?xml version="1.0" encoding="UTF-8"?>
<policy>
	<general>
		<name>%POLICY_NAME%</name>
		<enabled>true</enabled>
		<frequency>Ongoing</frequency>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
	</general>
	<scope>
		<all_computers>true</all_computers>
	</scope>
	<self_service>
		<use_for_self_service>true</use_for_self_service>
		<install_button_text>%INSTALL_BUTTON_TEXT%</install_button_text>
		<reinstall_button_text>%REINSTALL_BUTTON_TEXT%</reinstall_button_text>
		<self_service_display_name>%SELF_SERVICE_DISPLAY_NAME%</self_service_display_name>
		<self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
	</self_service>
	<maintenance>
		<recon>true</recon>
	</maintenance>
	<files_processes>
        <run_command>/usr/local/bin/jamf policy -event %POLICY_TRIGGER%</run_command>
    </files_processes>
</policy>