<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.</string>
	<key>Identifier</key>
	<string>com.github.stevewood-tx.recipes.jamf.GoogleChrome</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Applications</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Install %version%</string>
		<key>NAME</key>
		<string>Google Chrome</string>
		<key>POLICY_CATEGORY</key>
		<string>Applications</string>
		<key>POLICY_NAME</key>
		<string>All - %NAME% - Self Service</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-install-latest.xml</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Install %version%</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Google Chrome is a browser that combines a minimal design with sophisticated technology to make the web faster, safer, and easier.</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>%NAME%</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>replace_policy</key>
		<string>True</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>policy_name</key>
				<string>%POLICY_NAME%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
		</dict>
	</array>
</dict>
</plist>
